{
  "fever,cough,sore throat": {
    "conditions": ["Flu", "COVID-19", "Common Cold"],
    "recommendation": "It may be a viral infection. Monitor your temperature and stay hydrated. If symptoms persist for more than 3 days or worsen, consult a general practitioner."
  },
  "headache,blurred vision,nausea": {
    "conditions": ["Migraine", "Concussion", "High Blood Pressure"],
    "recommendation": "These symptoms could indicate a migraine or something more serious like high blood pressure. Avoid bright lights and loud sounds. If symptoms persist or vision gets worse, see a doctor."
  },
  "chest pain,shortness of breath,lightheadedness": {
    "conditions": ["Heart Attack", "Angina"],
    "recommendation": "These symptoms may be signs of a serious heart condition. Call emergency services immediately and do not attempt to move or walk too much."
  },
  "joint pain,stiffness,fatigue": {
    "conditions": ["Osteoarthritis", "Rheumatoid Arthritis"],
    "recommendation": "These are common signs of arthritis. Try to keep joints warm and avoid overuse. Book an appointment with your doctor for diagnosis and long-term management."
  },
  "fatigue,frequent urination,thirst": {
    "conditions": ["Diabetes", "Kidney Disorder"],
    "recommendation": "These could be early signs of diabetes or kidney issues. Avoid sugary drinks, stay hydrated, and make an appointment for a blood test or screening soon."
  },
  "loss of appetite,weight loss,fatigue": {
    "conditions": ["Cancer", "Thyroid Disorder", "Depression"],
    "recommendation": "Unexplained weight loss and tiredness can be caused by several conditions. Please see a doctor promptly for a full health screening."
  },
  "itchy eyes,sneezing,runny nose": {
    "conditions": ["Allergic Rhinitis", "Common Cold"],
    "recommendation": "These are often signs of allergies or a mild cold. Rest and consider using over-the-counter antihistamines. If symptoms persist for more than 5 days, consult a GP."
  },
  "back pain,stiffness,numbness": {
    "conditions": ["Herniated Disc", "Sciatica"],
    "recommendation": "This may be nerve-related back pain. Avoid heavy lifting and prolonged sitting. See a doctor or physiotherapist for evaluation."
  },
  "dizziness,blurred vision,weakness": {
    "conditions": ["Low Blood Pressure", "Stroke", "Diabetes"],
    "recommendation": "These symptoms could be due to blood sugar or circulation problems. Sit down immediately and avoid walking. Contact a healthcare provider if symptoms continue."
  },
  "abdominal pain,diarrhea,nausea": {
    "conditions": ["Gastroenteritis", "Food Poisoning"],
    "recommendation": "You may have a stomach infection or food poisoning. Drink plenty of fluids. Seek medical help if diarrhea lasts more than 2 days or includes blood."
  },
  "shortness of breath,swollen ankles,fatigue": {
    "conditions": ["Congestive Heart Failure", "COPD"],
    "recommendation": "These symptoms may indicate heart or lung problems. Avoid physical exertion and arrange to see your doctor for an urgent evaluation."
  },
  "rash,itchiness,swelling": {
    "conditions": ["Allergic Reaction", "Eczema", "Insect Bite"],
    "recommendation": "Apply anti-itch cream and avoid scratching. If swelling worsens or breathing is affected, call emergency services immediately."
  },
  "persistent cough,weight loss,night sweats": {
    "conditions": ["Tuberculosis", "Lung Cancer"],
    "recommendation": "These may be signs of a chronic lung issue. It’s important to visit a healthcare facility as soon as possible for screening and a chest X-ray."
  },
  "confusion,speech difficulty,one-sided weakness": {
    "conditions": ["Stroke"],
    "recommendation": "These are signs of a stroke. Call emergency services immediately. Do not wait — urgent treatment is critical to reduce long-term damage."
  },
  "depression,insomnia,loss of interest": {
    "conditions": ["Depression", "Anxiety Disorder"],
    "recommendation": "These signs point to a mental health issue. Reach out to a trusted friend or caregiver. Speak with a GP or counselor — support is available and effective treatments exist."
  }
}
